In [1]:
import pandas as pd
data={
    'fruit' : ['apple','banana','cherry','Apple','banana'],
    'color' : ['red','yellow','red','green','yellow']
}

In [2]:
###ONE-HOT ENCODING

In [3]:
df=pd.DataFrame(data)
df

    fruit   color
0   apple     red
1  banana  yellow
2  cherry     red
3   Apple   green
4  banana  yellow

In [4]:
#applying one-hot encoding
df_encoded= pd.get_dummies(df, columns=['color'],prefix=['color'])
df_encoded

    fruit  color_green  color_red  color_yellow
0   apple        False       True         False
1  banana        False      False          True
2  cherry        False       True         False
3   Apple         True      False         False
4  banana        False      False          True

In [5]:
#convert boolean to integer
convert_to_int = ['color_green','color_red','color_yellow']
df_encoded[convert_to_int] = df_encoded[convert_to_int].astype(int)
df_encoded

    fruit  color_green  color_red  color_yellow
0   apple            0          1             0
1  banana            0          0             1
2  cherry            0          1             0
3   Apple            1          0             0
4  banana            0          0             1

In [6]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\dell\anaconda3\lib\site-packages (1.5.1)
Requirement already satisfied: numpy>=1.19.5 in c:\users\dell\anaconda3\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\users\dell\anaconda3\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\users\dell\anaconda3\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\dell\anaconda3\lib\site-packages (from scikit-learn) (3.5.0)
Note: you may need to restart the kernel to use updated packages.

In [14]:
###label encoding

In [16]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [20]:
data={
    'car_id':[1,2,3,4,5],
    "transmission":['automatic',"manual","automatic","automatic","manual"]}

In [22]:
df=pd.DataFrame(data)
df

   car_id transmission
0       1    automatic
1       2       manual
2       3    automatic
3       4    automatic
4       5       manual

In [28]:
#applying label encoding
label_encoder = LabelEncoder()
df['Transmission_LabelEncoded']= label_encoder.fit_transform(df['transmission'])
print(df)

   car_id transmission  Transmission_LabelEncoded
0       1    automatic                          0
1       2       manual                          1
2       3    automatic                          0
3       4    automatic                          0
4       5       manual                          1

In [30]:
###ordinal encoding

In [32]:
import pandas as pd

In [38]:
data={
    "name":['alice','ilyas','abu','babu','dev'],
    "education_level":["high school",'master\'s','bachelor\'s','ph.d','bachelor\'s']}

In [40]:
df=pd.DataFrame(data)
df

    name education_level
0  alice     high school
1  ilyas        master's
2    abu      bachelor's
3   babu            ph.d
4    dev      bachelor's

In [42]:
ordinal_mapping={
    'high school':1,
    'bachelor\'s':2,
    'master\'s':3,
    'ph.d':4
}

In [46]:
df["education_level_encoded"]= df["education_level"].map(ordinal_mapping)
df

    name education_level  education_level_encoded
0  alice     high school                        1
1  ilyas        master's                        3
2    abu      bachelor's                        2
3   babu            ph.d                        4
4    dev      bachelor's                        2

In [1]:
##target encoding(mean encoding)

In [3]:
import pandas as pd
data={
    'city':['new york','london','tokyo','new york','london'],
    'salary':[80000,70000,75000,82000,71000]
}

In [5]:
df=pd.DataFrame(data)

In [7]:
#compute mean salary for each city
df['city_encoded']=df.groupby('city')['salary'].transform('mean')

df

       city  salary  city_encoded
0  new york   80000       81000.0
1    london   70000       70500.0
2     tokyo   75000       75000.0
3  new york   82000       81000.0
4    london   71000       70500.0

In [10]:
#frequency encoding (count encoding)

In [12]:
#apply frequency encoding
df["city_encoded"]=df["city"].map(df['city'].value_counts())
df

       city  salary  city_encoded
0  new york   80000             2
1    london   70000             2
2     tokyo   75000             1
3  new york   82000             2
4    london   71000             2